#include <stdio.h>
#include <locale.h>

void main()
{
    float w, d, h, m1, m2, m3, m4, m5, m, n;
    float tdvp, tdsp, twood,  dvp, dsp, wood; //Плотность и толщина  

    tdvp = 0.005f;
    tdsp = 0.015f;
    twood = 0.001f;

    printf("Введите плотность материала ДВП (кг/м^3)\n");
    scanf("%f", &dvp);

    printf("Введите плотность материала ДСП (кг/м^3)\n");
    scanf("%f", &dsp);

    printf("Введите плотность материала ДРЕВЕСИНА (кг/м^3)\n");
    scanf("%f", &wood);

    setlocale (LC_CTYPE,"rus");
    printf("Высота шкафа (от 180 до 220 (cм))");
    scanf("%f", &h);
    if ((h < 180) || (h > 220))
    h = h / 100;
    {
        printf("Введена неверная высота");
        return;
    }
    printf("Ширина шкафа (от 80 до 120 (cм))");
    scanf("%f", &w);
    if ((w < 80) || (w > 120))
	w = w / 100;
    {
        printf("Введена неверная ширина");
        return;
    }
    printf("Глубина шкафа (от 50 до 90 (cм))");
    scanf("%f", &d);
    if ((d < 50) || (d > 90))
	d = d / 100;
    {
        printf("Введена неверная глубина");
        return;
    }

    //Количество полок
    n = h / 40;
    
    //Расчет массы
    m1 = ((h - 2 * 0.015) * (w - 2 * 0.015) * tdvp * dvp);     //Задняя стенка     
    m2 = (2 * (h - 2 * 0.015) * (d - 0.005) * tdsp * dsp);     //Боковины   
    m3 = (2 * (w - 2 * 0.015) * (d - 0.005) * tdsp * dsp);     //Верхняя и нижняя крышки   
    m4 = ((h - 2 * 0.015) * (w - 2 * 0.015) * twood * wood);   //Двери
    m5 = (n * ((d - 0.005) * (w - 2 * 0.015) * tdsp));         //Полки
    
    //Общая масса
    printf("Масса шкафа (кг)");
    scanf("%f", &m);
    m = m1 + m2 + m3 + m4 + m5;
}
